title: a short capitalize title with less than 50 characters
id: you can generate one from here https://www.uuidgenerator.net/version4
status: experimental
description: A description of what your rule is meant to detect
references:
  - A list of all references that can help a reader or analyst to understand the meaning of a triggered rule
tags:
  - attack.execution  # example MITRE ATT&CK category
  - attack.t1059      # example MITRE ATT&CK technique id
  - car.2014-04-003   # example CAR ID
author: John Wick   # example, a list of authors
date: 2022/06/30  # Rule date
logsource:        # important for the field mapping in predefined or your additional configuration files
  category: process_creation  # In this example we choose the category 'process_creation' 
  product: windows    # the respective product
detection:
  selection:
    FieldName: 'StringValue' # a value that can be string or integer
    FieldName|modifier: 'Value'
  condition: selection # you can filter here
fields:
  - fields in the log source that are important to investigate further
falsepositives:
  - describe possible false positive conditions to help the analysts in their investigation
level: one of four levels (low, medium, high, critical) 